# Gold Price Data Analysis

### Adding the imports

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sb
import plotly.express as px

### Creating the DataFrame

In [3]:
df = pd.read_csv("gold.csv")

### Reading the data

In [4]:
df.head()

                  time     open    high      low    close  rsi14    sma14
0  2010-01-03 18:00:00  1098.45  1100.0  1098.05  1099.95  81.98  1096.38
1  2010-01-03 18:05:00  1100.00  1100.3  1099.45  1099.75  79.17  1096.72
2  2010-01-03 18:10:00  1099.70  1100.1  1099.30  1099.45  75.02  1097.03
3  2010-01-03 18:15:00  1099.50  1099.6  1098.50  1099.45  75.02  1097.30
4  2010-01-03 18:20:00  1099.40  1099.6  1098.90  1098.90  67.50  1097.50

In [5]:
df.tail()

,time,open,high,low,close,rsi14,sma14
985999,2023-12-29 16:35:00,2063.07,2063.24,2062.60,2062.96,39.44,2063.48
986000,2023-12-29 16:40:00,2062.95,2063.09,2062.52,2062.61,37.12,2063.27
986001,2023-12-29 16:45:00,2062.60,2062.83,2062.34,2062.56,36.79,2063.06
986002,2023-12-29 16:50:00,2062.56,2063.20,2062.51,2062.54,36.65,2062.95
986003,2023-12-29 16:55:00,2062.52,2063.00,2062.37,2062.73,39.05,2062.90

### Exploring the data

In [6]:
df.shape

(986004, 7)

In [7]:
df.columns

Index(['time', 'open', 'high', 'low', 'close', 'rsi14', 'sma14'], dtype='object')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 986004 entries, 0 to 986003
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   time    986004 non-null  object
 1   open    986004 non-null  float64
 2   high    986004 non-null  float64
 3   low     986004 non-null  float64
 4   close   986004 non-null  float64
 5   rsi14   986004 non-null  float64
 6   sma14   986004 non-null  float64
dtypes: float64(6), object(1)
memory usage: 52.7+ MB

### Filtering and exploring the _null_ values

In [10]:
df.isnull().sum()

time     0
open     0
high     0
low      0
close    0
rsi14    0
sma14    0
dtype: int64

### Data Types

In [11]:
df.dtypes

time      object
open     float64
high     float64
low      float64
close    float64
rsi14    float64
sma14    float64
dtype: object

### Converting the "time" column datatype to date-time format

In [14]:
df['time'] = pd.to_datetime(df['time'])

In [15]:
df.head(2)

                 time     open    high      low    close  rsi14    sma14
0 2010-01-03 18:00:00  1098.45  1100.0  1098.05  1099.95  81.98  1096.38
1 2010-01-03 18:05:00  1100.00  1100.3  1099.45  1099.75  79.17  1096.72

In [16]:
df.dtypes

time     datetime64[ns]
open            float64
high            float64
low             float64
close           float64
rsi14           float64
sma14           float64
dtype: object

### Adding the "Year" column

In [20]:
df["Year"] = pd.to_datetime(df["time"]).dt.year

In [21]:
df.head(2)

                 time  Year     open    high      low    close  rsi14    sma14
0 2010-01-03 18:00:00  2010  1098.45  1100.0  1098.05  1099.95  81.98  1096.38
1 2010-01-03 18:05:00  2010  1100.00  1100.3  1099.45  1099.75  79.17  1096.72

### Adding the "Month" column

In [22]:
df["Month"] = pd.to_datetime(df["time"]).dt.month

In [23]:
df.head(2)

,time,Year,open,high,low,close,rsi14,sma14,Month
0,2010-01-03 18:00:00,2010,1098.45,1100.0,1098.05,1099.95,81.98,1096.38,1
1,2010-01-03 18:05:00,2010,1100.00,1100.3,1099.45,1099.75,79.17,1096.72,1

## Research Questions